class HiIn {
  static const Map<String, String> map = {
    'hello': 'नमस्ते',
    'name': 'प्रदीप कुमार',
    'menu_about': 'मेरे बारे में',
    'menu_skills': 'कुशलताएं',
    'menu_projects': 'प्रोजैक्ट',
    'menu_contact': 'संपर्क',
    'about_me': 'मेरा परिचय',
    'about_me_text':
        'फुल स्टैक फ्लटर डेवलपर । फ्लटर और पायथन में रूचि । फ्लटर, फायरबेस, जावा, पाइथन, जैंगो, स्कुअल और गिट में कुशल। जीवन के लिए उपयोगी सॉफ्टवेयर उत्पादों का विकास करना। सक्रिय शिक्षार्थी और रचनात्मक दिमाग। सॉफ्टवेयर विकास जुनून है।',
    'more_about_me': 'मेरे बारे में कुछ और',
    'more_about_me_text1':
        'मुझे ऑनलाइन दुनिया में प्रदीप तिनताली के नाम से भी जाना जाता है। बस गूगल करिये प्रदीप तिनतालीऔर आपको मेरा सारा सोशल मीडिया और अन्य प्लेटफॉर्म मिल जाएगा जहां मैं हूं। वर्तमान में मैं जीएल बजाज इंस्टिट्यूट ऑफ टेक्नोलॉजी एंड मैनेजमेंट में कंप्यूटर विज्ञान के चौथे वर्ष का छात्र हूं। मैं समस्या समाधान को महत्व देता हूं।',
    'more_about_me_text2':
        'मैंने लिटकोड  पर 190+ समस्याओं को हल किया है और मैंने कोडशेफ पर 3 स्टार हासिल किया है। लेकिन मैं कोडिंग से ज्यादा डेवलपमेंट पर ध्यान देता हूं।',
    'more_about_me_text3':
        'मुझे लगता है कि अब आपके पास मेरे बारे में पर्याप्त जानकारी है। नीचे मेरा विवरण पोर्टफोलियो है जहां मैंने अपने कौशल, परियोजनाओं और संपर्क जानकारी का उल्लेख किया है।',
    'top_skills': 'मेरे शीर्ष कौशल',
    'recent_projects': 'मेरे हाल ही के कुछ प्रोजेक्ट',
    'project1_title': 'अध्ययन विश्लेषक',
    'project2_title': 'स्थानीय दुकान गाइड',
    'project3_title': 'सॉर्टिंग विज़ुअलाइज़र',
    'project1_description':
        'टेक स्टैक में रिएक्ट , रेडक्स और फायरबेस का इस्तेमाल किया। परीक्षा दें और छात्रमित्र के साथ अपने विषय ज्ञान का विश्लेषण करें। रिजल्ट प्रदर्शन, परीक्षा मोड और गेम मोड में  क्विज के आधार पर अपने दोस्तों के साथ सीखना  मुख्य विशेषताएं हैं।',
    'project2_description':
        'टेक स्टैक्स में फ़्लटर और फायरबेस का इस्तेमाल किया। यह ऐप उपयोगकर्ताओं को अपने आस-पास की सबसे अच्छी दुकान खोजने में मदद करता है। यह विक्रेताओं को इस ऐप पर अपनी दुकान सूचीबद्ध करके अधिक ग्राहक प्राप्त करने में भी मदद करता है। मुख्य विशेषताओं में दुकान पर नेविगेट करना, विक्रेता को सीधे कॉल करना और रेटिंग शामिल हैं।',
    'project3_description':
        'टेक स्टैक फ़्लटर का इस्तेमाल किया। ग्राफ के साथ विभिन्न सॉर्टिंग एल्गोरिदम के सोर्ट समय को देखें। अलग-अलग एल्गोरिदम के छँटाई समय की तुलना करने के लिए तुलना विकल्प भी उपलब्ध है। सर्वश्रेष्ठ/औसत मामले बनाम सबसे खराब मामले की तुलना भी उपलब्ध है।',
    'project_action': 'इसे देखें',
    'get_in_touch': 'मुझसे संपर्क करें',
    'contact_name': 'नाम',
    'name_hint': 'अपना नाम दर्ज करें',
    'email': 'ईमेल',
    'email_hint': 'अपना ईमेल दर्ज करें',
    'message': 'संदेश',
    'message_hint': 'अपना संदेश दर्ज करें',
    'submit': 'भेजें',
    'copyright': '© कॉपीराइट 2021',
    'built_with': '❤ के साथ द्वारा निर्मित',
    'built_with_name': 'प्रदीप तिनताली',
  };
}
