class HiIn {
  static const Map<String, String> map = {
    'hello': 'नमस्ते',
    'name': 'प्रदीप कुमार',
    'menu_about':'मेरे बारे में',
    'menu_skills':'कुशलताएं',
    'menu_projects':'प्रोजैक्ट',
    'menu_contact':'संपर्क',
    'about_me': 'मेरा परिचय',
    'about_me_text': 'फुल स्टैक Flutter डेवलपर । Flutter में 3+ वर्ष का अनुभव। Flutter, फायरबेस, जावा, Python, Django, MySQL और Git में कुशल। जीवन के लिए उपयोगी सॉफ्टवेयर उत्पादों का विकास करना। सक्रिय शिक्षार्थी और रचनात्मक दिमाग। सॉफ्टवेयर विकास जुनून है।',
    'more_about_me': 'मेरे बारे में कुछ और',
    'more_about_me_text1': 'मुझे ऑनलाइन दुनिया में प्रदीप तिनताली के नाम से भी जाना जाता है। बस गूगल करिये प्रदीप तिनतालीऔर आपको मेरा सारा सोशल मीडिया और अन्य प्लेटफॉर्म मिल जाएगा जहां मैं हूं। वर्तमान में मैं जीएल बजाज इंस्टिट्यूट ऑफ टेक्नोलॉजी एंड मैनेजमेंट में कंप्यूटर विज्ञान के चौथे वर्ष का छात्र हूं। मैं समस्या समाधान को महत्व देता हूं।',
    'more_about_me_text2': 'मैंने लिटकोड  पर 190+ समस्याओं को हल किया है और मैंने कोडशेफ पर 3 स्टार हासिल किया है। लेकिन मैं कोडिंग से ज्यादा डेवलपमेंट पर ध्यान देता हूं।',
    'more_about_me_text3': 'मुझे लगता है कि अब आपके पास मेरे बारे में पर्याप्त जानकारी है। नीचे मेरा विवरण पोर्टफोलियो है जहां मैंने अपने कौशल, परियोजनाओं और संपर्क जानकारी का उल्लेख किया है।',
    'top_skills':'मेरे शीर्ष कौशल',
    'recent_projects':'मेरे हाल ही के कुछ प्रोजेक्ट',
  };
}
